Тестовая_база_ERP_14/src/DataProcessors/сшпПодключениеКАдаптеру/сшпПодключениеКАдаптеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>сшпПодключениеКАдаптеру</name>
  <comment>Настройка ручного подключения к адаптеру</comment>
  <attributes>
    <name>ФорматОбмена</name>
    <type>
      <types>EnumRef.сшпФорматыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверАдаптеров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяАдаптера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКоннектора</name>
    <type>
      <types>EnumRef.сшпТипыКоннекторовESB</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Тестовая_база_ERP_14/src/Enums/сшпТипыКоннекторовESB/сшпТипыКоннекторовESB.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>сшпТипыКоннекторовESB</name>
  <enumValues>
    <name>REST</name>
  </enumValues>
  <enumValues>
    <name>SOAP</name>
  </enumValues>
  <enumValues>
    <name>Pipe</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/DataProcessors/сшпПодключениеКАдаптеру/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьПараметрыПодключения(Команда)
	серверСохранитьПараметрыПодключения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура серверСохранитьПараметрыПодключения()
	сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпФорматСообщений", Объект.ФорматОбмена);
	сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпТипИспользуемогоКоннектораESB", Объект.ТипКоннектора);
	Если Объект.ТипКоннектора = Перечисления.сшпТипыКоннекторовESB.SOAP тогда 
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпАдресАдаптераESB", "http://" + Объект.СерверАдаптеров + "/adapters/" + Объект.ИмяАдаптера + "/send");
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпИмяСервисаESB", "IngoingService1C");
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпИмяТочкиПодключенияESB", "BasicHttpBinding_IIngoingService1C");
	ИначеЕсли Объект.ТипКоннектора = Перечисления.сшпТипыКоннекторовESB.REST тогда
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпАдресАдаптераESB", Объект.СерверАдаптеров + "/adapters/");
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпИмяСервисаESB", Объект.ИмяАдаптера + "/in");
		сшпРаботаСКонстантами.УстановитьЗначениеКонстанты("сшпИмяТочкиПодключенияESB", "/send");
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти
